app/Models/Auth/AuthModel.php

    public function verifyLogin($args)
    {
        $builder = $this->db->table('jadelyn_pharmacy_users');

        $builder->where('username', $args['username']);
        $builder->where('active', 1);
        $query = $builder->get();
---
SELECT *
FROM `jadelyn_pharmacy_users`
WHERE `username` = 'jadelyn_admin'
AND `active` = 1