app/Models/CommonModel.php

    public function getProductListItems()
    {
        $builder = $this->db->table('jadelyn_pharmacy_generic_name');
        $builder->select('id, name');
        $builder->where('active', 1);
        $query = $builder->get();

        $genericName =  $query->getResult();

        $builder = $this->db->table('jadelyn_pharmacy_brand_name');
        $builder->select('id, name');
        $builder->where('active', 1);
        $query = $builder->get();

        $brandName =  $query->getResult();

        $builder = $this->db->table('jadelyn_pharmacy_product_types');
        $builder->select('id, name');
        $builder->where('active', 1);
        $query = $builder->get();
---
SELECT `id`, `name`
FROM `jadelyn_pharmacy_generic_name`
WHERE `active` = 1
SELECT `id`, `name`
FROM `jadelyn_pharmacy_brand_name`
WHERE `active` = 1
SELECT `id`, `name`
FROM `jadelyn_pharmacy_product_types`
WHERE `active` = 1